posts/nastroika-emacs-dlia-svelte/index.html
<!DOCTYPE html>
<html prefix="
        og: http://ogp.me/ns# article: http://ogp.me/ns/article#
    " vocab="http://ogp.me/ns" lang="ru">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Настройка emacs для svelte | VelikiiNehochuha Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="ru" href="../../rss.xml">
<link rel="canonical" href="http://velikiinehochuha.github.io/posts/nastroika-emacs-dlia-svelte/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Velikii Nehochuha">
<link rel="prev" href="../binarnyi-poisk-realizatsiia-na-python/" title="Бинарный поиск (реализация на python)" type="text/html">
<link rel="next" href="../zadachi-po-kursu-sicp/" title="Задачи по курсу SICP. Введение." type="text/html">
<meta property="og:site_name" content="VelikiiNehochuha Blog">
<meta property="og:title" content="Настройка emacs для svelte">
<meta property="og:url" content="http://velikiinehochuha.github.io/posts/nastroika-emacs-dlia-svelte/">
<meta property="og:description" content="Установить необходимые пакеты в emacs


Я добавил поддержку svelte шаблонов сравнительно недавно, поэтому web-mode
c поддержкой svelte доступен пока только в unstable melpa


package-install web-mode
">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-11-26T22:58:31+03:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="eslint">
<meta property="article:tag" content="svelte">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Перейти к главному содержимому</a>
    <div id="container">
            <header id="header"><h1 id="brand"><a href="http://velikiinehochuha.github.io/" title="VelikiiNehochuha Blog" rel="home">

        <span id="blog-title">VelikiiNehochuha Blog</span>
    </a></h1>

        
            <nav id="menu"><ul>
<li><a href="../../archive.html">Архив</a></li>
                <li><a href="../../categories/">Тэги</a></li>
                <li><a href="../../rss.xml">RSS лента</a></li>

    
    
    
    </ul></nav></header><main id="content"><article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Настройка emacs для svelte</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Velikii Nehochuha
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2019-11-26T22:58:31+03:00" itemprop="datePublished" title="2019-11-26 22:58">2019-11-26 22:58</time></a>
            </p>
                    <p class="sourceline"><a href="index.org" class="sourcelink">Источник</a></p>

        </div>
        
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgf99b1d5" class="outline-2">
<h2 id="orgf99b1d5">Установить необходимые пакеты в emacs</h2>
<div class="outline-text-2" id="text-orgf99b1d5">
<p>
Я добавил поддержку svelte шаблонов сравнительно недавно, поэтому web-mode
c поддержкой svelte доступен пока только в unstable melpa
</p>

<div class="highlight"><pre><span></span><span class="nv">package-install</span> <span class="nv">web-mode</span>
<span class="nv">package-install</span> <span class="nv">add-node-modules-path</span>
<span class="nv">package-install</span> <span class="nv">flycheck</span>
</pre></div>
</div>
</div>

<div id="outline-container-org53994fa" class="outline-2">
<h2 id="org53994fa">Настроим web-mode</h2>
<div class="outline-text-2" id="text-org53994fa">
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nb">load</span> <span class="s">"~/.emacs.d/web-mode.el"</span><span class="p">)</span>
<span class="p">(</span><span class="nv">add-to-list</span> <span class="ss">'auto-mode-alist</span> <span class="o">'</span><span class="p">(</span><span class="s">"\\.svelte\\'"</span> <span class="o">.</span> <span class="nv">web-mode</span><span class="p">))</span>
<span class="p">(</span><span class="nv">add-to-list</span> <span class="ss">'auto-mode-alist</span> <span class="o">'</span><span class="p">(</span><span class="s">"\\.html\\'"</span> <span class="o">.</span> <span class="nv">web-mode</span><span class="p">))</span>
<span class="p">(</span><span class="nv">add-to-list</span> <span class="ss">'auto-mode-alist</span> <span class="o">'</span><span class="p">(</span><span class="s">"\\.jsx\\'"</span> <span class="o">.</span> <span class="nv">web-mode</span><span class="p">))</span>
<span class="p">(</span><span class="nv">add-to-list</span> <span class="ss">'auto-mode-alist</span> <span class="o">'</span><span class="p">(</span><span class="s">"\\.js\\'"</span> <span class="o">.</span> <span class="nv">web-mode</span><span class="p">))</span>

<span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-engines-alist</span>
    <span class="o">'</span><span class="p">((</span><span class="s">"django"</span>    <span class="o">.</span> <span class="s">"\\.html\\'"</span><span class="p">))</span>
<span class="p">)</span>
<span class="p">(</span><span class="nb">defun</span> <span class="nv">my-web-mode-hook</span> <span class="p">()</span>
  <span class="s">"Hooks for Web mode."</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-indent-style</span> <span class="mi">2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-markup-indent-offset</span> <span class="mi">2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-css-indent-offset</span> <span class="mi">2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-code-indent-offset</span> <span class="mi">2</span><span class="p">)</span> <span class="c1">;; 4</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-style-padding</span> <span class="mi">2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-script-padding</span> <span class="mi">2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-block-padding</span> <span class="mi">2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">setq</span> <span class="nv">web-mode-part-padding</span> <span class="mi">2</span><span class="p">)</span>
<span class="p">)</span>
<span class="p">(</span><span class="nv">add-hook</span> <span class="ss">'web-mode-hook</span>  <span class="ss">'my-web-mode-hook</span><span class="p">)</span>
</pre></div>
</div>
</div>


<div id="outline-container-org8aa27a8" class="outline-2">
<h2 id="org8aa27a8">Настройка eslint</h2>
<div class="outline-text-2" id="text-org8aa27a8">
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nb">when</span> <span class="p">(</span><span class="nv">maybe-require-package</span> <span class="ss">'add-node-modules-path</span><span class="p">)</span>
  <span class="p">(</span><span class="nv">after-load</span> <span class="ss">'web-mode</span>
    <span class="p">(</span><span class="nv">add-hook</span> <span class="ss">'web-mode-hook</span> <span class="ss">'add-node-modules-path</span><span class="p">)))</span>
<span class="p">(</span><span class="nv">setenv</span> <span class="s">"PATH"</span> <span class="p">(</span><span class="nv">concat</span> <span class="p">(</span><span class="nv">getenv</span> <span class="s">"PATH"</span><span class="p">)</span> <span class="s">":/home/anton/.nvm/versions/node/v10.15.3/bin/"</span><span class="p">))</span>
<span class="p">(</span><span class="k">setq</span> <span class="nv">exec-path</span> <span class="p">(</span><span class="nb">append</span> <span class="nv">exec-path</span> <span class="o">'</span><span class="p">(</span><span class="s">"/home/anton/.nvm/versions/node/v10.15.3/bin"</span><span class="p">)))</span>
<span class="p">(</span><span class="k">setq</span> <span class="nv">flycheck-javascript-eslint-executable</span> <span class="s">"eslint_d"</span><span class="p">)</span>
<span class="p">(</span><span class="nv">with-eval-after-load</span> <span class="ss">'flycheck</span>
  <span class="p">(</span><span class="nv">flycheck-add-mode</span> <span class="ss">'javascript-eslint</span> <span class="ss">'web-mode</span><span class="p">))</span>
</pre></div>
</div>

<div id="outline-container-org5604b4a" class="outline-3">
<h3 id="org5604b4a">установить глобально eslint<sub>d</sub>
</h3>
<div class="outline-text-3" id="text-org5604b4a">
<div class="highlight"><pre><span></span>npm install -g eslint eslint_d
</pre></div>
</div>
</div>
<div id="outline-container-orgf8cce70" class="outline-3">
<h3 id="orgf8cce70">установить в директорию с проектом</h3>
<div class="outline-text-3" id="text-orgf8cce70">
<div class="highlight"><pre><span></span>npm install eslint-plugin-svelte3 babel-eslint --save-dev
</pre></div>
</div>
</div>

<div id="outline-container-org632c4ab" class="outline-3">
<h3 id="org632c4ab">в директорию с проектом поместить .eslintrc</h3>
<div class="outline-text-3" id="text-org632c4ab">
<div class="highlight"><pre><span></span>{
  "parserOptions": { "ecmaVersion": 2019, "sourceType": "module" },
  "env": {
    "es6": true,
    "browser": true,
    "node": true
  },
  "plugins": [
    "svelte3"
  ],
  "overrides": [
    {
      "files": ["**/*.svelte"],
      "processor": "svelte3/svelte3"
    }
  ],
  "rules": {
    //"no-undefined": 2,
    "no-unused-vars": 2,
    "no-use-before-define": 2
  }
}
</pre></div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/emacs/" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../../categories/eslint/" rel="tag">eslint</a></li>
            <li><a class="tag p-category" href="../../categories/svelte/" rel="tag">svelte</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../binarnyi-poisk-realizatsiia-na-python/" rel="prev" title="Бинарный поиск (реализация на python)">Предыдущая запись</a>
            </li>
            <li class="next">
                <a href="../zadachi-po-kursu-sicp/" rel="next" title="Задачи по курсу SICP. Введение.">Следующая запись</a>
            </li>
        </ul></nav></aside></article></main><footer id="footer"><p>Contents © 2020         <a href="mailto:anton.s.pilipenko@gmail.com">Velikii Nehochuha</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
                <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
